import FlowerShop.Shop;

import java.math.BigInteger;
import java.util.List;
import java.util.Random;
import java.util.Scanner;

import static java.lang.Math.*;


public class Main{
    public static void main(String[] args) {
//        variant_A();
        variant_B();
    }
    /*
     * Создать приложение, удовлетворяющее требованиям, приведенным в задании. Наследование применять только в тех заданиях, в которых это логически
     * обосновано. Аргументировать принадлежность классу каждого создаваемого
     * метода и корректно переопределить для каждого класса методы equals(),
     * hashCode(), toString().
     */
    /**
     * Вариант А
     * 1. Создать объект класса Текст, используя классы Предложение, Слово.
     * Методы: дополнить текст, вывести на консоль текст, заголовок текста
     */
    static void variant_A() {
        Text t = new Text("Hello world !");

        t.add_sentence(new Sentence("First sentence."));
        t.add_sentence(new Sentence("Second sentence."));
        t.add_sentence(new Sentence("Third sentence."));

        t.print_title();
        t.print_text();
    }

    /*
    Создать консольное приложение, удовлетворяющее следующим требованиям:
     * • Использовать возможности ООП: классы, наследование, полиморфизм, инкапсуляция.
     * • Каждый класс должен иметь отражающее смысл название и информативный состав.
     * • Наследование должно применяться только тогда, когда это имеет смысл.
     * • При кодировании должны быть использованы соглашения об оформлении
     * кода java code convention.
     * • Классы должны быть грамотно разложены по пакетам.
     * • Консольное меню должно быть минимальным.
     * • Для хранения параметров инициализации можно использовать файлы.
     */
    /**
     * Вариант В
     * 1. Цветочница. Определить иерархию цветов. Создать несколько объектов цветов. Собрать букет (используя аксессуары)
     * с определением его стоимости. Провести сортировку цветов в букете на основе уровня свежести. Найти
     * цветок в букете, соответствующий заданному диапазону длин стеблей.
     */
    static void variant_B() {
        Scanner sc = new Scanner(System.in);
        Shop shop = new Shop();


    }

}

